clutchitggs/ESP32_EdgeAI/firmware/sdkconfig.defaults
# =============================================================================
# Default project configuration for the XIAO ESP32-S3 Sense audio analyzer.
# Run `idf.py menuconfig` to adjust further; this file seeds reasonable values.
# =============================================================================

# --- Target chip -------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --- Partition table ---------------------------------------------------------
# Custom CSV gives us a single 2 MB app slot which is plenty here and leaves
# headroom for OTA / SPIFFS in the future.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- PSRAM (Octal SPI on the XIAO ESP32-S3 Sense, 8 MB) ----------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Flash --------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- HTTP server with WebSocket support --------------------------------------
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512

# --- Main task / FreeRTOS ----------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# --- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Compiler ----------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
